Revit 2026 API

# FailuresAccessor Class

---

An interface class that provides access to failure information posted in a document and methods to resolve these failures.

SystemObject Autodesk.Revit.DBFailuresAccessor

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FailuresAccessor : IDisposable
```
```vb
Public Class FailuresAccessor
	Implements IDisposable
```
```cpp
public ref class FailuresAccessor : IDisposable
```
```fsharp
type FailuresAccessor =
    class
        interface IDisposable
    end
```

The FailuresAccessor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | CanCommitPendingTransaction | Checks if pending failure processing can be finished by committing a pending transaction. |
|  | CanRollBackPendingTransaction | Checks if pending failure processing can be finished by rolling back a pending transaction. |
|  | CommitPendingTransaction | Finishes pending failures processing by committing the pending transaction. |
|  | DeleteAllWarnings | Deletes all FailureMessages of severity "Warning" currently posted in a document. |
|  | DeleteElements |  |
|  | DeleteWarning | Deletes one specific failure message of severity "Warning". |
|  | Dispose | Releases all resources used by the FailuresAccessor |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAttemptedResolutionTypes | Returns list of the failure resolution types attempted for the failure in the current transaction. |
|  | GetDocument | Provides access to a document for which failures are being processed or preprocessed. |
|  | GetFailureHandlingOptions | Provides access to the failure handling options for the transaction currently being finished. |
|  | GetFailureMessages | Provides access to the individual failure messages currently posted in the document. |
|  | GetFailureMessages(FailureSeverity) | Provides access to the individual failure messages if a given severity currently posted in the document. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSeverity | Provides access to the current failure severity. |
|  | GetTransactionName | Retrieves the name of the transaction for which failures are being processed. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsActive | Method allows to check if this instance of the accessor is currently active. |
|  | IsElementsDeletionPermitted | Checks if resolution of the failures by deleting failure elements is permitted. |
|  | IsElementsDeletionPermitted(IListElementId) |  |
|  | IsElementsDeletionPermitted(IListElementId, String) |  |
|  | IsFailureResolutionPermitted | Checks if resolution of failures is permitted. |
|  | IsFailureResolutionPermitted(FailureMessageAccessor) | Checks if default resolution of the failure is permitted. |
|  | IsFailureResolutionPermitted(FailureMessageAccessor, FailureResolutionType) | Checks if resolution of the failure using given resolution type is permitted. |
|  | IsPending | Checks if the failure processing is pending. |
|  | IsTransactionBeingCommitted | Checks if the transaction for which failures are processed is being committed or rolled back. |
|  | JournalFailures |  |
|  | PostFailure | Posts an additional failure message to be processed for the current transaction. |
|  | ReplaceFailures | Deletes all failure messages currently posted in a document and replaces them with one "generic" failure. |
|  | ResolveFailure | Resolves one failure using the failure resolution type last set for it. |
|  | ResolveFailures |  |
|  | RollBackPendingTransaction | Finishes pending failures processing by rolling back the pending transaction. |
|  | SetFailureHandlingOptions | Sets failure handling options for the transaction currently being finished. |
|  | SetTransactionName | Changes the name of the transaction for which failures are being processed. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

An instance of this class can be obtained only as an argument passed to interfaces used in the process of failure resolution and is the only available interface to fetch information about failures in a document. While reading from a document during failure processing is allowed, the only way to modify document during failure resolution is via methods provided by this class. After returning from failure processing, the instance of the class is deactivated and cannot be used any longer.

#### Reference

Autodesk.Revit.DB Namespace